xeon/20240119-1801-glibc/3-locks-mempool/32768/pgbench-warmup-1000-1.log
pgbench (17devel)
transaction type: <builtin: select only>
scaling factor: 1000
partition method: range
partitions: 1
query mode: prepared
number of clients: 32
number of threads: 32
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 27417498
number of failed transactions: 0 (0.000%)
latency average = 0.070 ms
initial connection time = 162.317 ms
tps = 458170.297889 (without initial connection time)